#include <stdio.h>


int isPrime(int num);

int main() {
    int number;

    do {
        // Введення числа в користувача

        printf("Введіть ціле число: ");
        if (scanf("%d", &number) != 1)
        {
            printf("Помилка введення. Будь ласка, введіть ціле число.\n");
            while (getchar() != '\n'); // Очищення буфера введення
        }
        else
        {
            // Перевірка, чи є введене число простим
            if (isPrime(number))
            {
                printf("%d є простим числом.\n", number);
                break; // Вихід з циклу, оскільки було введено підходяще число
            } else
            {
                printf("%d не є простим числом. Будь ласка, спробуйте ще раз.\n", number);
            }
        }
    } while (1); // Безкінечний цикл, який виходить лише при введенні простого числа

    return 0;
}

// Функція для перевірки, чи є число простим
int isPrime(int num)
{
    if (num <= 1)
    {
        return 0; // 0 та 1 не є простими числами
    }

    for (int i = 2; i * i <= num; ++i)
    {
        if (num % i == 0)
        {
            return 0; // Знайдено дільник, число не є простим
        }
    }

    return 1; // Якщо жодний дільник не знайдено, число є простим
}